//INIDASD1 JOB (U),'INIT DASD',NOTIFY=&SYSUID,MSGCLASS=J
/*JOBPARM SYSAFF=NWRD
//*
//STEP01   EXEC PGM=IKJEFT01,DYNAMNBR=110
//SYSTSPRT DD   SYSOUT=*
//SYSTSIN  DD   *
 OC
 RO *ALL,V 40E0,OFFLINE
 RO *ALL,V 4044,OFFLINE
 RO *ALL,V 4050,OFFLINE
 RO *ALL,V 4084,OFFLINE
 RO *ALL,V 4100,OFFLINE
 RO *ALL,V 4109,OFFLINE
 END
//
/*
