//INIDASD3 JOB (U),'INIT DASD',NOTIFY=&SYSUID,MSGCLASS=J
/*JOBPARM SYSAFF=NWRD
//*
//STEP01   EXEC PGM=IKJEFT01,DYNAMNBR=110
//SYSTSPRT DD   SYSOUT=*
//SYSTSIN  DD   *
 OC
 RO *ALL,V 40E0,ONLINE
 RO *ALL,V 4044,ONLINE
 RO *ALL,V 4050,ONLINE
 RO *ALL,V 4084,ONLINE
 RO *ALL,V 4100,ONLINE
 RO *ALL,V 4109,ONLINE
 END
//
/*
