//INIDASD4 JOB (U),'INIT DASD',NOTIFY=&SYSUID,MSGCLASS=J
/*JOBPARM SYSAFF=NWRD
//*
//JS010   EXEC PGM=IDCAMS
//SYSPRINT DD  SYSOUT=*
//SYSIN    DD  *
 DEFINE CLUSTER (NAME(SYS1.VVDS.VZY401E)  -
        VOL(ZY401E) NONINDEXED            -
        CYL(1 1))
 DEFINE CLUSTER (NAME(SYS1.VVDS.VZY401F)  -
        VOL(ZY401F) NONINDEXED            -
        CYL(1 1))
 DEFINE CLUSTER (NAME(SYS1.VVDS.VZY4020)  -
        VOL(ZY4020) NONINDEXED            -
        CYL(1 1))
