//INIDASD5 JOB (U),'INIT DASD',NOTIFY=&SYSUID,MSGCLASS=J
/*JOBPARM SYSAFF=NWRD
//*
//STEP01   EXEC PGM=IKJEFT01,DYNAMNBR=110
//SYSTSPRT DD   SYSOUT=*
//SYSTSIN  DD   *
 OC
 VARY SMS,VOL(SIZ911,ALL),ENABLE
 VARY SMS,VOL(SIZ912,ALL),ENABLE
 VARY SMS,VOL(SIZ913,ALL),ENABLE
 VARY SMS,VOL(SIZ914,ALL),ENABLE
 END
//
/*
