//*--------------------------------------------------------------------
//STEP011  EXEC PGM=IEBGENER     ##### SUBMITS LISTCAT COMMANDS   ####
//SYSIN     DD DUMMY
//SYSPRINT  DD SYSOUT=*
//SYSUT1    DD DISP=SHR,DSN=UGUSP.STG.COPYAXJ.D200722
//SYSUT2    DD SYSOUT=(A,INTRDR)
