//LW2487A3 JOB (UU999999999,T925),'STORAGE',MSGLEVEL=(1,1),
//    MSGCLASS=R,NOTIFY=&SYSUID
//* EXAMINE %CDS
//*********** VALIDADO - OK
//EXAMINE1 EXEC PGM=IDCAMS,REGION=80M
//SYSPRINT  DD DSN=UGUSP.HSM.EXAMINE.MCDS.D240507,
//          DISP=(,CATLG),SPACE=(TRK,(1,1),RLSE),
//          DCB=(LRECL=133,RECFM=FB)
//SYSIN     DD *
 EXAMINE NAME(DFHSM.MCDS) -
         INDEXTEST DATATEST ERRORLIMIT(1000)
