/* REXX */

/* random number from x to y */
say random(1,9)

/* compare chars from right to left */
say compare('smith','zmith')

/* convert decimal to hexadecimal */
say d2x(271)

/* standardize spacing between words by x */
say space("this contains different   spacing   words",2)

/* remove word from position,amount */ 
say delword("xyz removing word",1,2)

/* date format */
say date('u') time()
