//IU5735A1 JOB (UU999999999,T925),'STORAGE',MSGLEVEL=(1,1),             00030018
//    MSGCLASS=R,NOTIFY=&SYSUID,TIME=1000                               00040018
//STEP1     EXEC PGM=IDCAMS,COND=(0,NE)                                 00050000
//SYSPRINT DD DSN=UGUSP.LISTC.PRE.CATALOG.UCATQ.DFHSM,                  00060021
//          UNIT=3390,DISP=(,CATLG),SPACE=(CYL,(1,1),RLSE)              00070014
//SYSIN     DD *                                                        00080000
   LISTC ENT(CATALOG.UCATQ.DFHSM   ) CAT(CATALOG.UCATQ.DFHSM  ) ALL     00090021
   LISTC ENT(CATALOG.UCATQ.DFHSM   ) CAT(CATALOG.MCATQQ) ALL            00139021
   LISTC ENT(CATALOG.UCATQ.DFHSM   ) CAT(CATALOG.MCATQX) ALL            00140021
