//IU5735A5 JOB (UU999999999,T925),'STORAGE',MSGLEVEL=(1,1),
//    MSGCLASS=J,NOTIFY=&SYSUID,TIME=1000
//EXAMINE  EXEC PGM=IDCAMS,REGION=0M                                    00043000
//SYSPRINT  DD DSN=UGUSP.EXAM.CATALOG.UCATQ.DFHSM,                      00044000
//          DISP=(,CATLG),SPACE=(TRK,(1,1),RLSE),
//          DCB=(LRECL=133,RECFM=FB)
//SYSIN     DD *
 EXAMINE NAME(CATALOG.UCATQ.DFHSM      ) -
         INDEXTEST DATATEST ERRORLIMIT(1000)
