//LW2487A0 JOB (UU999999999,T925),'STORAGE1',MSGLEVEL=(1,1),
//    MSGCLASS=R,NOTIFY=&SYSUID
//STEP1     EXEC PGM=ADRDSSU,COND=(0,NE)
//SYSPRINT  DD SYSOUT=*
//SAIDA     DD DSN=UGUSP.HSM.DMP.BCDS.TAPE.D240507,BLKSIZE=32760,
//          DISP=(,CATLG),UNIT=TAPEC
//SYSIN     DD *
   DUMP   OUTDD(SAIDA) CANCELERROR  TOL(ENQF) -
          DATASET(INCL(  DFHSM.BCDS ))
