//LW2487A2 JOB (UU999999999,T915),'STGMGMT',CLASS=0,MSGCLASS=R,
//         TIME=100,NOTIFY=&SYSUID
//STEP1    EXEC PGM=ADRDSSU
//IN       DD UNIT=3390,VOL=SER=HSMM00,DISP=SHR
//OUT      DD UNIT=3390,VOL=SER=HSMM01,DISP=SHR
//SYSPRINT DD SYSOUT=R
//SYSIN    DD *
 COPY DATASET(INCLUDE(UG99S.DFHSM.PARMLIB)) -
     INDD(IN) OUTDD(OUT) ALLD(*) ALLX  CATALOG -
     RENAMEU((UG99S.DFHSM.PARMLIB,UG99S.DFHSM.PARMLIB.NEW))
