//LW2487A2 JOB (UU999999999,T915),'STGMGMT',CLASS=0,MSGCLASS=R,
//         TIME=100,NOTIFY=&SYSUID
//STEP1    EXEC PGM=ADRDSSU
//IN       DD UNIT=3390,VOL=SER=DZZM03,DISP=SHR
//OUT      DD UNIT=3390,VOL=SER=CDSM04,DISP=SHR
//SYSPRINT DD SYSOUT=R
//SYSIN    DD *
 COPY DATASET(INCLUDE(DFHSM.JRNL)) -
     INDD(IN) OUTDD(OUT) ALLD(*) ALLX CATALOG -
       RENAMEU((DFHSM.JRNL,DFHSM.JRNL.NEW))
