//IU5735AD JOB (UU999999999,T915),'STGMGMT',CLASS=0,MSGCLASS=R,
//         TIME=100,NOTIFY=&SYSUID
//STEP1    EXEC PGM=ADRDSSU
//IN       DD UNIT=3390,VOL=SER=YYYYYY,DISP=SHR
//OUT      DD UNIT=3390,VOL=SER=XXXXXX,DISP=SHR
//SYSPRINT DD SYSOUT=R
//SYSIN    DD *
 COPY DATASET(INCLUDE(DFHSM.XXXX.XXXX.XXXXX)) -
     INDD(IN) OUTDD(OUT) ALLD(*) ALLX DELETE CATALOG
//*
       RENAMEU((DFHSM.BACKUP.MCDS.DS*.D0002351, -
           DFHSM.BACKUP.MCDS.DS1A.D0002351)) ADMIN TOL(ENQF) -
