//IU5735AT JOB (UU999999999,T925),'STORAGE',MSGLEVEL=(1,1),
//    MSGCLASS=R,NOTIFY=&SYSUID
//***************************************************************
//DUMP1 EXEC  PGM=ADRDSSU
//SYSPRINT DD    SYSOUT=*
//DASD     DD    UNIT=SYSDA,VOL=SER=(HSM108),DISP=SHR
//SAIDA    DD    DSN=UGUSP.FULLDMP.TAPE.HSM108,DISP=(,CATLG),
//       UNIT=TAPEC
//SYSIN    DD    *
  DUMP FULL INDDNAME(DASD) OUTDDNAME(SAIDA) -
             CONCURRENT
