//IU5735AD JOB (UU999999999,T925),'STORAGE',MSGLEVEL=(1,1),
//    MSGCLASS=R,NOTIFY=&SYSUID
//STEP3     EXEC PGM=ADRDSSU
//SYSPRINT  DD SYSOUT=*
//SAIDA     DD DSN=UG99P.BKP.DUMPALL.CATALOGS(+1),
//        DISP=(,CATLG),SPACE=(CYL,(10,10),RLSE),UNIT=3390
//SYSIN     DD *
   DUMP DS(INCL(UG99P.BKP.D22269.**)) -
        OUTDD(SAIDA) OPT(4) CAN
