//IU5735AZ JOB (UU999999999,T925),'STORAGE',MSGLEVEL=(1,1),
//    MSGCLASS=R,NOTIFY=&SYSUID,CLASS=A
//BR14     EXEC PGM=IEFBR14
//*D1     DD DSN=CATALOG.SMS.FLB2.TEST.VOLUMES,
//*D1     DD DSN=UGUSP.TEST.VOLUMES,STORCLAS=GSPACE,
//DD1     DD DSN=CATALOG.TEST.VOLUMES,
//       DISP=(,CATLG),SPACE=(TRK,(1,1)),UNIT=3390,RECFM=FB,
//  VOL=SER=Z15660
