//DEFRAG00 EXEC PGM=ADRDSSU,REGION=5000K                                        
//SYSPRINT DD SYSOUT=H                                                          
//DD00 DD UNIT=3390,DISP=SHR,VOL=SER=ZHEAVA                                     
//SYSIN DD *                                                                    
 DEFRAG DDNAME(DD00) FRAGI(0) WAIT(1,1) MMOVPCT(75)                             