//RMMHKEXP JOB (1013STOR),'ITHIG',                                              
//   MSGLEVEL=(1,1),MSGCLASS=A,NOTIFY=ITHIG                                     
//EDGHSKP   EXEC   PGM=EDGHSKP,                                                 
//      PARM='EXPROC'                                                     
//SYSPRINT  DD  SYSOUT=*                                                        
//MESSAGE   DD  DSN=DFRMM.MESSAGE.INIT.FILE,DISP=SHR                            
