//STEP05  EXEC PGM=FTP,REGION=0M                                                
//SYSMDUMP DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//OUTPUT DD SYSOUT=*                                                            
//INPUT DD *                                                                    
 9.214.130.75                                                                   
 ITHIG ********                                                                 
 BIN                                                                            
 MVSPUT 'ITHIG.DUMP.RMDSCIAS.DMP01.TERSE'                                       
 QUIT   