//DTAVELI1 JOB (995F88,BIN,122,001,,IU),'DTAVELI',
// MSGLEVEL=(1,1),MSGCLASS=I,NOTIFY=&SYSUID
//STEP1   EXEC PGM=ICKDSF,PARM='NOREPLYU'
//SYSPRINT DD  SYSOUT=*
//SYSIN    DD  *
   INIT UNIT( 3D00 ) DEVICETYPE(3390) VOLID( ZZ3D00 )  -
    VTOC(0,01,14) VFY( DMP904 ) NODS SG
