//DTAVELI1 JOB (995F88,BIN,122,001,,IU),'DTAVELI',
// MSGLEVEL=(1,1),MSGCLASS=I,NOTIFY=&SYSUID
//STEP1   EXEC PGM=ICKDSF,PARM='NOREPLYU'
//SYSPRINT DD  SYSOUT=*
//SYSIN    DD  *
 INIT UNIT(777A) VOLID(FC777A) VFY(8K777A) VTOC(0,1,14) NIX
 INIT UNIT(777B) VOLID(FC777B) VFY(8K777B) VTOC(0,1,14) NIX
 INIT UNIT(777C) VOLID(FC777C) VFY(8K777C) VTOC(0,1,14) NIX
 INIT UNIT(777D) VOLID(FC777D) VFY(8K777D) VTOC(0,1,14) NIX
