//*
//MOVEDS     EXEC PGM=ADRDSSU
//SYSPRINT    DD  SYSOUT=*
//DISKI       DD  VOL=SER=STG108,UNIT=SYSALLDA,DISP=SHR
//DISKO       DD  VOL=SER=STG906,UNIT=SYSALLDA,DISP=SHR
//SYSIN       DD  *
   COPY OUTDD(DISKO)    -
        INDD(DISKI)     -
    DATASET(INCLUDE(TWS.V9R1M0.MERGLOG.JOBEXEC) -
           EXCL(        -
           SYS1.VVDS.**,     -
           ))           -
    ALLDATA(*) ALLX -
    SPHERE -
    RECATALOG(*) DELETE
