//RECATVS EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN DD *
 DEF CLUSTER(NAME(ZH00004.CHISPRO1.DATA ) -
 VOL(SLG002) -
 RECATALOG) -
 CAT(CATALOG.ICF.VTSOIDS3)