//RECATNV EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN DD *
 DEF NVSAM(NAME(DDPF.DDPFBLD.PROD.LOAD ) -
 DEVT(3390) VOL(SSM108))
 /*OR
 DEFINE NONVSAM(NAME(‘DATASET.NAME’) +
 DEVT(3390) VOLUME(xxxxxx)) CAT(‘SEU.MASTERCATALOG