//STP1 EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN DD *
 DEF NONVSAM (NAME (DB2GEO.DB2V10.CLEANR.D140713) -
 DEVT(3490) -
 VOLUMES(K58239,K18840,K58777))