//******************
//* TERSE (PACK) JOB:
//******************
//TERSE1  EXEC PGM=TRSMAIN,PARM='PACK' TERSE
//INFILE   DD  DISP=SHR,DSN=MVSDATA.DUMP.D180426.T130417.MVST.S00445
//OUTFILE  DD  DSN=LUCASAR.JES2NODE.ISSUE.MVST.TRS,
//             DISP=(,CATLG,DELETE),
//             UNIT=SYSDA,SPACE=(TRK,(3000,300),RLSE)
//SYSPRINT DD  SYSOUT=*
//
