//DELDS EXEC PGM=IEFBR14
//LDDCOL DD DSN=&PREF.DCOLL,
// DISP=(MOD,DELETE),SPACE=(TRK,(0)),UNIT=3390
/*
/*OR
/*DEL UNCAT
// DISP=(MOD,DELETE),SPACE=(TRK,1),VOL=SER=SMTG18