//***********************
//* UNTERSE (UNPACK) JOB:
//***********************
//UNTRS1  EXEC PGM=TRSMAIN,PARM='UNPACK'  UNTERSE
//INFILE   DD  DISP=SHR,DSN=STGADMIN.TTOC.DUMP.T00048.TERSE
//OUTFILE  DD  DISP=(,CATLG),DSN=STGADMIN.TTOC.DUMP.T00048,
//             UNIT=(SYSDA,8),
//             SPACE=(CYL,(2000,2000),RLSE),DSNTYPE=LARGE
//SYSPRINT DD  SYSOUT=*
