//LIMPA    EXEC PGM=IDCAMS
//SYSPRINT  DD  SYSOUT=*
//SYSIN     DD  *
 DELETE ITHIG.VTS.TEST NSCR
 SET MAXCC =0
/*
//*
//GRAVA    EXEC PGM=ICEGENER
//SYSIN     DD  DUMMY
//SYSPRINT  DD  DUMMY
//SYSUT2    DD  DSN=ITHIG.VTS.TEST,DISP=(NEW,CATLG,DELETE),
//          UNIT=3490,LABEL=1,RECFM=FB,LRECL=80,DSORG=PS,RETPD=1
//SYSUT1    DD  *
*** TESTE DO VTS - FITA DE 06GB ***
/*
//*
//PRINT    EXEC PGM=ICEGENER
//SYSIN     DD  DUMMY
//SYSPRINT  DD  DUMMY
//SYSUT1    DD  DSN=ITHIG.VTS.TEST,DISP=OLD
//SYSUT2    DD  SYSOUT=*
//
